HW1/HW1-hshen4.org
#+TITLE: CS615 HW1
#+AUTHOR: Hongyi Shen
#+EMAIL: hshen4 AT stevens DOT edu
#+LANGUAGE: en
#+OPTIONS: H:2 num:nil toc:t \n:nil @:t ::t |:t ^:nil f:t *:t TeX:t LaTeX:t skip:nil p:nil
#+STYLE: <link rel="stylesheet" type="text/css" href="worg.css" />
* Setup Environment for EC2 and create an instance
** Configuration AWS CLI tools
   - Due to ec2 tools are already installed under =/opt/ec2tools-1.4=,
     all we need to do is edit bashrc file.
   - Check lab's java version.
     Use ~java -version~ to get java version, make sure it >=1.6. If
     it is not, there is nothing we can do about it.
   - Tell CLI tools where they live
     open ~/.bashrc, add EC2 configuration below to tell the tools who you
     are. The private key and X.509 certification can be retrived
     from Security Credentials page. (The newer version use access key
     and secret key to verify)
	 #+BEGIN_SRC sh
     export EC2_HOME=/opt/ec2tools-1.4
     export PATH=$PATH:$EC2_HOME/bin
     export EC2_PRIVATE_KEY=~/.ec2/pk-XXXXXXXXXXX.cer
     export EC2_CERT=~/.ec2/cert-XXXXXXXXXXXXXXXX.cer
     export JAVA_HOME=/usr
	 #+END_SRC
   - To protect the private key from been peeked by others, ~chmod 600
     .bashrc~. After that, ~source .bashrc~ to re execute the script.

** Create a EC2 instance (OmniOS)
   - Specifiy the image ::
	 To specify the OmniOS we want, one way to find needed ami-id is:
	 #+BEGIN_SRC bash
	 ec2-describe-images -x all | grep OmniOS
	 #+END_SRC
	 For Linux
	 According to the version infomation, we know the wanted ami-id
     for OmniOS is *ami-505ce739*
   - Create a keypair for further ssh usage ::
	 #+BEGIN_SRC bash
     ec2-create-keypair omni-keypair
     #+END_SRC	

	 Then copy the output private key to create omni-keypair.pem.
	 Set the permission of this file. Only the creater can view it.
	 #+BEGIN_SRC bas
     chmod 400 omni-keypair.pem
     #+END_SRC

   - Create a Security group ::
	 Create the security group to allow only several ports can access
     it
	 #+BEGIN_SRC bash
     ec2-create-group omni-ports -d "Security Group for OmniOS"
	 ec2-authorize omni-ports -P tcp -p 22
     #+END_SRC

   - Run the instance ::
	 Lanuch the instance, use the infomation we got before(ami-id,
     keypair and security group)
  	 #+BEGIN_SRC bash
     ec2-run-instances ami-505ce739 -k omni-keypair -g omni-ports -t t1.micro
     #+END_SRC

   - Connect to the instance via SSH ::
	 Now login to the running instance with given keypair:
     #+BEGIN_SRC bash
     ssh -i omni-keypair.pem root@<Public DNS>
     #+END_SRC
	
   - Check and terminate ::
	 To check the status of instance
	 #+BEGIN_SRC bash
     ec2-describe-instance <instance id>
     #+END_SRC
     To terminate instance:
	 #+BEGIN_SRC bash
     ec2-terminate-instace <instance id>
     #+END_SRC

	 
** Show Instance info
   - display basic system information  ::
	 ~uname -a~
	 #+BEGIN_SRC bash
	 SunOS domU-12-31-39-0F-1C-BB.compute-1.internal 5.11 omnios-33fdde4 i86pc i386 i86xpv Solaris
	 #+END_SRC
   - display the partition table ::
	 Unfortunately, I didn't find fstab in Solaris. So, use this command:
	 ~format~
	 ~format> verify~
	 The output are below:
	#+BEGIN_SRC bash
	 Primary label contents:
     Volume name = <        >
     ascii name  = <DEFAULT cyl 4085 alt 2 hd 128 sec 32>
     pcyl        = 4087
     ncyl        = 4085
     acyl        =    2
     bcyl        =    0
     nhead       =  128
     nsect       =   32
     Part      Tag    Flag     Cylinders        Size            Blocks
      0       root    wm       1 - 4084        7.98GB    (4084/0/0) 16728064
      1 unassigned    wu       0               0         (0/0/0)           0
      2     backup    wu       0 - 4084        7.98GB    (4085/0/0) 16732160
      3 unassigned    wu       0               0         (0/0/0)           0
      4 unassigned    wu       0               0         (0/0/0)           0
      5 unassigned    wu       0               0         (0/0/0)           0
      6 unassigned    wu       0               0         (0/0/0)           0
      7 unassigned    wu       0               0         (0/0/0)           0
      8       boot    wu       0 -    0        2.00MB    (1/0/0)        4096
      9 unassigned    wu       0               0         (0/0/0)           0
	 #+END_SRC
   - display the currently mounted filesystems ::
	 ~mount~
	#+BEGIN_SRC bash
	 / on syspool/ROOT/omnios-r151004 read/write/setuid/devices/dev=1850002 on Wed Dec 31 19:00:00 1969
	 /devices on /devices read/write/setuid/devices/dev=8240000 on Fri Jan 24 00:14:59 2014
	 /dev on /dev read/write/setuid/devices/dev=8280000 on Fri Jan 24 00:14:59 2014
	 /system/contract on ctfs read/write/setuid/devices/dev=8340001 on Fri Jan 24 00:15:02 2014
	 /proc on proc read/write/setuid/devices/dev=82c0000 on Fri Jan 24 00:15:02 2014
	 /etc/mnttab on mnttab read/write/setuid/devices/dev=8380001 on Fri Jan 24 00:15:02 2014
	 /etc/svc/volatile on swap read/write/setuid/devices/xattr/dev=83c0001 on Fri Jan 24 00:15:02 2014
	 /system/object on objfs read/write/setuid/devices/dev=8400001 on Fri Jan 24 00:15:02 2014
	 /etc/dfs/sharetab on sharefs read/write/setuid/devices/dev=8440001 on Fri Jan 24 00:15:02 2014
	 /lib/libc.so.1 on /usr/lib/libc/libc_hwcap3.so.1 read/write/setuid/devices/dev=1850002 on Fri Jan 24 00:15:44 2014
	 /dev/fd on fd read/write/setuid/devices/dev=8540001 on Fri Jan 24 00:15:48 2014
	 /tmp on swap read/write/setuid/devices/xattr/dev=83c0002 on Fri Jan 24 00:15:49 2014
	 /var/run on swap read/write/setuid/devices/xattr/dev=83c0003 on Fri Jan 24 00:15:49 2014
	 /syspool on syspool read/write/setuid/devices/nonbmand/exec/xattr/atime/dev=1850007 on Fri Jan 24 00:15:58 2014
	 #+END_SRC
   - display available disk space ::
	 use ~df~ command, with human readable format
	 ~df -h~
	 #+BEGIN_SRC bash
	 Filesystem                      Size  Used Avail Use% Mounted on
	 syspool/ROOT/omnios-r151004     7.9G  777M  7.1G  10% /
	 swap                            215M  288K  215M   1% /etc/svc/volatile
	 /usr/lib/libc/libc_hwcap3.so.1  7.9G  777M  7.1G  10% /lib/libc.so.1
	 swap                            215M     0  215M   0% /tmp
	 swap                            215M   36K  215M   1% /var/run
	 syspool                         7.1G   37K  7.1G   1% /syspool
	 #+END_SRC
	 
