HW1/HW1-hshen4.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>CS615 HW1</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="CS615 HW1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-01-25T00:50-0500"/>
<meta name="author" content="Hongyi Shen"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="worg.css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">CS615 HW1</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Setup Environment for EC2 and create an instance</a>
<ul>
<li><a href="#sec-1-1">Configuration AWS CLI tools</a></li>
<li><a href="#sec-1-2">Create a EC2 instance (OmniOS)</a></li>
<li><a href="#sec-1-3">Show Instance info</a></li>
<li><a href="#sec-1-4">Commands to run</a></li>
<li><a href="#sec-1-5">Create another instance (Linux)</a></li>
<li><a href="#sec-1-6">Show Instance info</a></li>
<li><a href="#sec-1-7">Commands to run</a></li>
<li><a href="#sec-1-8">Reference</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Setup Environment for EC2 and create an instance</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">Configuration AWS CLI tools</h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li>Due to ec2 tools are already installed under <code>/opt/ec2tools-1.4</code>,
     all we need to do is edit bashrc file.
</li>
<li>Check lab's java version.
     Use <code>java -version</code> to get java version, make sure it &gt;=1.6. If
     it is not, there is nothing we can do about it.
</li>
<li>Tell CLI tools where they live
     open ~/.bashrc, add EC2 configuration below to tell the tools who you
     are. The private key and X.509 certification can be retrived
     from Security Credentials page. (The newer version use access key
     and secret key to verify)



<pre class="example">export EC2_HOME=/opt/ec2tools-1.4
export PATH=$PATH:$EC2_HOME/bin
export EC2_PRIVATE_KEY=~/.ec2/pk-XXXXXXXXXXX.cer
export EC2_CERT=~/.ec2/cert-XXXXXXXXXXXXXXXX.cer
export JAVA_HOME=/usr
</pre>

</li>
<li>To protect the private key from been peeked by others, <code>chmod 600      .bashrc</code>. After that, <code>source .bashrc</code> to re execute the script.
</li>
</ul>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">Create a EC2 instance (OmniOS)</h3>
<div class="outline-text-3" id="text-1-2">

<dl>
<dt>Specifiy the image</dt><dd>
<p>
     To specify the OmniOS we want, one way to find needed ami-id is:
</p>


<pre class="example">ec2-describe-images -x all | grep OmniOS
</pre>

<p>
     For Linux
     According to the version infomation, we know the wanted ami-id
     for OmniOS is <b>ami-505ce739</b>
</p></dd>
<dt>Create a keypair for further ssh usage</dt><dd>



<pre class="example">ec2-create-keypair omni-keypair
</pre>


<p>
     Then copy the output private key to create omni-keypair.pem.
     Set the permission of this file. Only the creater can view it.
</p>


<pre class="example">chmod 400 omni-keypair.pem
</pre>


</dd>
<dt>Create a Security group</dt><dd>
<p>
     Create the security group to allow only several ports can access
     it
</p>


<pre class="example">ec2-create-group omni-ports -d "Security Group for OmniOS"
ec2-authorize omni-ports -P tcp -p 22
</pre>


</dd>
<dt>Run the instance</dt><dd>
<p>
     Lanuch the instance, use the infomation we got before(ami-id,
     keypair and security group)
</p>


<pre class="example">ec2-run-instances ami-505ce739 -k omni-keypair -g omni-ports -t t1.micro
</pre>


</dd>
<dt>Connect to the instance via SSH</dt><dd>
<p>
     Now login to the running instance with given keypair:
</p>


<pre class="example">ssh -i omni-keypair.pem root@&lt;Public DNS&gt;
</pre>


</dd>
<dt>Check and terminate</dt><dd>
<p>
     To check the status of instance
</p>


<pre class="example">ec2-describe-instance &lt;instance id&gt;
</pre>

<p>
     To terminate instance:
</p>


<pre class="example">ec2-terminate-instace &lt;instance id&gt;
</pre>

</dd>
</dl>



</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">Show Instance info</h3>
<div class="outline-text-3" id="text-1-3">

<dl>
<dt>display basic system information </dt><dd>
<p>
     <code>uname -a</code>
</p>


<pre class="example">SunOS domU-12-31-39-0F-1C-BB.compute-1.internal 5.11 omnios-33fdde4 i86pc i386 i86xpv Solaris
</pre>

</dd>
<dt>display the partition table</dt><dd>
<p>
     Unfortunately, I didn't find fstab in Solaris. So, use this command:
     <code>format</code>
     <code>format&gt; verify</code>
     The output are below:
</p>


<pre class="example">Primary label contents:
Volume name = &lt;        &gt;
ascii name  = &lt;DEFAULT cyl 4085 alt 2 hd 128 sec 32&gt;
pcyl        = 4087
ncyl        = 4085
acyl        =    2
bcyl        =    0
nhead       =  128
nsect       =   32
Part      Tag    Flag     Cylinders        Size            Blocks
 0       root    wm       1 - 4084        7.98GB    (4084/0/0) 16728064
 1 unassigned    wu       0               0         (0/0/0)           0
 2     backup    wu       0 - 4084        7.98GB    (4085/0/0) 16732160
 3 unassigned    wu       0               0         (0/0/0)           0
 4 unassigned    wu       0               0         (0/0/0)           0
 5 unassigned    wu       0               0         (0/0/0)           0
 6 unassigned    wu       0               0         (0/0/0)           0
 7 unassigned    wu       0               0         (0/0/0)           0
 8       boot    wu       0 -    0        2.00MB    (1/0/0)        4096
 9 unassigned    wu       0               0         (0/0/0)           0
</pre>

</dd>
<dt>display the currently mounted filesystems</dt><dd>
<p>
     <code>mount</code>
</p>


<pre class="example">/ on syspool/ROOT/omnios-r151004 read/write/setuid/devices/dev=1850002 on Wed Dec 31 19:00:00 1969
/devices on /devices read/write/setuid/devices/dev=8240000 on Fri Jan 24 00:14:59 2014
/dev on /dev read/write/setuid/devices/dev=8280000 on Fri Jan 24 00:14:59 2014
/system/contract on ctfs read/write/setuid/devices/dev=8340001 on Fri Jan 24 00:15:02 2014
/proc on proc read/write/setuid/devices/dev=82c0000 on Fri Jan 24 00:15:02 2014
/etc/mnttab on mnttab read/write/setuid/devices/dev=8380001 on Fri Jan 24 00:15:02 2014
/etc/svc/volatile on swap read/write/setuid/devices/xattr/dev=83c0001 on Fri Jan 24 00:15:02 2014
/system/object on objfs read/write/setuid/devices/dev=8400001 on Fri Jan 24 00:15:02 2014
/etc/dfs/sharetab on sharefs read/write/setuid/devices/dev=8440001 on Fri Jan 24 00:15:02 2014
/lib/libc.so.1 on /usr/lib/libc/libc_hwcap3.so.1 read/write/setuid/devices/dev=1850002 on Fri Jan 24 00:15:44 2014
/dev/fd on fd read/write/setuid/devices/dev=8540001 on Fri Jan 24 00:15:48 2014
/tmp on swap read/write/setuid/devices/xattr/dev=83c0002 on Fri Jan 24 00:15:49 2014
/var/run on swap read/write/setuid/devices/xattr/dev=83c0003 on Fri Jan 24 00:15:49 2014
/syspool on syspool read/write/setuid/devices/nonbmand/exec/xattr/atime/dev=1850007 on Fri Jan 24 00:15:58 2014
</pre>

</dd>
<dt>display available disk space</dt><dd>
<p>
     use <code>df</code> command, with human readable format
     <code>df -h</code>
</p>


<pre class="example">Filesystem                      Size  Used Avail Use% Mounted on
syspool/ROOT/omnios-r151004     7.9G  777M  7.1G  10% /
swap                            215M  288K  215M   1% /etc/svc/volatile
/usr/lib/libc/libc_hwcap3.so.1  7.9G  777M  7.1G  10% /lib/libc.so.1
swap                            215M     0  215M   0% /tmp
swap                            215M   36K  215M   1% /var/run
syspool                         7.1G   37K  7.1G   1% /syspool
</pre>

</dd>
</dl>


</div>

</div>
