HW1/HW1-hshen4.org
** Commands to run
   - ~uname -a~ ::
  	 #+BEGIN_SRC bash
 	 SunOS domU-12-31-39-0F-1C-BB.compute-1.internal 5.11 omnios-33fdde4 i86pc i386 i86xpv Solaris
	 #+END_SRC
   - ~whoami~ ::
	 #+BEGIN_SRC bash
	 root
	 #+END_SRC
   - ~date~ ::
	 #+BEGIN_SRC bash
	 January 24, 2014 12:58:47 AM EST
	 #+END_SRC
   - ~w~ ::
   	 #+BEGIN_SRC bash
	 12:59am  up 44 min(s),  1 user,  load average: 0.00, 0.00, 0.00
	 User     tty           login@  idle   JCPU   PCPU  what
	 root     pts/1        12:30am                      w
	 #+END_SRC
   - ~ifconfig -a~ ::
	 #+BEGIN_SRC bash
	 lo0: flags=2001000849<UP,LOOPBACK,RUNNING,MULTICAST,IPv4,VIRTUAL> mtu 8232 index 1
     inet 127.0.0.1 netmask ff000000 
	 xnf0: flags=1004843<UP,BROADCAST,RUNNING,MULTICAST,DHCP,IPv4> mtu 1500 index 2
     inet 172.31.43.110 netmask fffff000 broadcast 172.31.47.255
     ether 12:a7:95:b4:79:71 
	 lo0: flags=2002000849<UP,LOOPBACK,RUNNING,MULTICAST,IPv6,VIRTUAL> mtu 8252 index 1
     inet6 ::1/128 
	 xnf0: flags=20002000840<RUNNING,MULTICAST,IPv6> mtu 1500 index 2
     inet6 ::/0 
     ether 12:a7:95:b4:79:71 
	 #+END_SRC 
   - ~netstat -na~ ::
	 #+BEGIN_SRC bash
	 UDP: IPv4
	 Local Address        Remote Address      State
	 -------------------- -------------------- ----------
     *.68                                Idle
     *.546                               Idle
	 172.31.43.110.68                          Idle
     *.111                               Idle
     *.*                                 Unbound
     *.34664                             Idle
     *.111                               Idle
     *.*                                 Unbound
     *.62730                             Idle
     *.*                                 Unbound
	 
	 UDP: IPv6
	 Local Address                     Remote Address                   State      If
	 --------------------------------- --------------------------------- ---------- -----
     *.546                                                         Idle       
     *.111                                                         Idle       
     *.*                                                           Unbound    
     *.34664                                                       Idle       
     *.*                                                           Unbound    
	 
	 TCP: IPv4
	 Local Address        Remote Address    Swind Send-Q Rwind Recv-Q    State
	 -------------------- -------------------- ----- ------ ----- ------ -----------
	 127.0.0.1.4999             *.*                0      0 128000      0 LISTEN
     *.111                *.*                0      0 128000      0 LISTEN
     *.*                  *.*                0      0 128000      0 IDLE
     *.111                *.*                0      0 128000      0 LISTEN
     *.*                  *.*                0      0 128000      0 IDLE
     *.50196              *.*                0      0 128000      0 LISTEN
     *.44266              *.*                0      0 128000      0 LISTEN
     *.22                 *.*                0      0 128000      0 LISTEN
	 172.31.43.110.22     72.76.187.129.56666  131040      0 128872      0 ESTABLISHED
	 
	 TCP: IPv6
	 Local Address                     Remote Address                 Swind Send-Q Rwind Recv-Q   State      If
	 --------------------------------- --------------------------------- ----- ------ ----- ------ ----------- -----
     *.111                             *.*                             0      0 128000      0 LISTEN      
     *.*                               *.*                             0      0 128000      0 IDLE        
     *.44266                           *.*                             0      0 128000      0 LISTEN      
     *.22                              *.*                             0      0 128000      0 LISTEN      
	 
	 Active UNIX domain sockets
	 Address  Type          Vnode     Conn  Local Addr      Remote Addr
	 ffffff0098279b38 stream-ord ffffff0098096900 0000000 /tmp/ssh-XX4maWeb/agent.550                
	 ffffff0096613020 dgram      ffffff009709e980 0000000 /var/run/in.ndpd_mib                
	 ffffff00966133d0 stream-ord ffffff009709eb80 0000000 /var/run/in.ndpd_ipadm                
	 ffffff0096613780 stream-ord ffffff009707ca80 0000000 /var/run/.inetd.uds                
	 ffffff0096613b30 stream-ord 0000000 0000000 /var/run/hald/dbus-AkvYKxbIUb                
	 ffffff009651d018 stream-ord 0000000 0000000 /var/run/dbus/system_bus_socket                
	 ffffff009651d3c8 stream-ord 0000000 ffffff0096257d00                /var/run/dbus/system_bus_socket 
	 ffffff009651d778 stream-ord 0000000 ffffff0096413700                /var/run/hald/dbus-AkvYKxbIUb 
	 ffffff009651db28 stream-ord 0000000 0000000 /var/run/hald/dbus-AkvYKxbIUb                
	 ffffff009640c010 stream-ord 0000000 ffffff0096413700                /var/run/hald/dbus-AkvYKxbIUb 
	 ffffff009640c3c0 stream-ord 0000000 0000000 /var/run/hald/dbus-chK7PX7wXr                
	 ffffff009640c770 stream-ord 0000000 ffffff009637b000                /var/run/hald/dbus-chK7PX7wXr 
	 ffffff009640cb20 stream-ord ffffff009637b000 0000000 /var/run/hald/dbus-chK7PX7wXr                
	 ffffff0095461008 stream-ord 0000000 0000000                               
	 ffffff00954613b8 stream-ord 0000000 0000000                               
	 ffffff0095461768 stream-ord ffffff0096413700 0000000 /var/run/hald/dbus-AkvYKxbIUb                
	 ffffff0095461b18 stream-ord ffffff0096257d00 0000000 /var/run/dbus/system_bus_socket 
	 #+END_SRC

** Create another instance (Linux)
   The process of create a linux instance almost the same. The only
   difference is choose a Linux ami-id, in this case, I
   choose *ami-ab36fbc2*, ubuntu-lucid-10.04, 32 bit. Again, login
   with =SSH=, if is for long term usage, we can add host to =~/.ssh/config=.
   
