HW1/HW1-hshen4.html

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6">Show Instance info</h3>
<div class="outline-text-3" id="text-1-6">

<dl>
<dt>display basic system information</dt><dd>
<p>
     <code>uname -a</code>
</p>


<pre class="example">Linux ip-172-31-39-169 2.6.32-318-ec2 #38-Ubuntu SMP Thu Sep 1 17:54:33 UTC 2011 i686 GNU/Linux
</pre>

</dd>
<dt>display the partition table</dt><dd>
<p>
     <code>less /etc/fstab</code>
</p>


<pre class="example"># /etc/fstab: static file system information.
# &lt;file system&gt;                                 &lt;mount point&gt;   &lt;type&gt;  &lt;options&gt;       &lt;dump&gt;  &lt;pass&gt;
proc                                            /proc           proc    nodev,noexec,nosuid 0       0
LABEL=cloudimg-rootfs                                       /               ext3    defaults        0       0
/dev/sda2  /mnt    auto    defaults,nobootwait,comment=cloudconfig 0   0
</pre>

</dd>
<dt>display the currently mounted filesystems</dt><dd>
<p>
     <code>mount | column -t</code>
</p>


<pre class="example">/dev/sda1  on  /                     type  ext3        (rw)
proc       on  /proc                 type  proc        (rw,noexec,nosuid,nodev)
none       on  /sys                  type  sysfs       (rw,noexec,nosuid,nodev)
none       on  /sys/kernel/debug     type  debugfs     (rw)
none       on  /sys/kernel/security  type  securityfs  (rw)
none       on  /dev                  type  devtmpfs    (rw,mode=0755)
none       on  /dev/pts              type  devpts      (rw,noexec,nosuid,gid=5,mode=0620)
none       on  /dev/shm              type  tmpfs       (rw,nosuid,nodev)
none       on  /var/run              type  tmpfs       (rw,nosuid,mode=0755)
none       on  /var/lock             type  tmpfs       (rw,noexec,nosuid,nodev)
none       on  /lib/init/rw          type  tmpfs       (rw,nosuid,mode=0755)
</pre>

</dd>
<dt>display available disk space</dt><dd>
<p>
      <code>df -h</code>
</p>


<pre class="example">Filesystem                      Size  Used Avail Use% Mounted on
syspool/ROOT/omnios-r151004     7.9G  777M  7.1G  10% /
swap                            215M  288K  215M   1% /etc/svc/volatile
/usr/lib/libc/libc_hwcap3.so.1  7.9G  777M  7.1G  10% /lib/libc.so.1
swap                            215M     0  215M   0% /tmp
swap                            215M   36K  215M   1% /var/run
syspool                         7.1G   37K  7.1G   1% /syspool
</pre>

</dd>
</dl>

</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7">Commands to run</h3>
<div class="outline-text-3" id="text-1-7">

<dl>
<dt><code>uname -a</code></dt><dd>



<pre class="example">Linux ip-172-31-39-169 2.6.32-318-ec2 #38-Ubuntu SMP Thu Sep 1 17:54:33 UTC 2011 i686 GNU/Linux
</pre>

</dd>
<dt><code>whoami</code></dt><dd>



<pre class="example">ubuntu
</pre>

</dd>
<dt><code>date</code></dt><dd>



<pre class="example">Fri Jan 24 17:53:31 UTC 2014
</pre>

</dd>
<dt><code>w</code></dt><dd>



<pre class="example">17:54:05 up 14 min,  1 user,  load average: 0.00, 0.00, 0.00
USER     TTY      FROM              LOGIN@   IDLE   JCPU   PCPU WHAT
ubuntu   pts/0    pool-72-76-187-1 17:51    0.00s  0.19s  0.00s w
</pre>

</dd>
<dt><code>ifconfig -a</code></dt><dd>



<pre class="example">dummy0    Link encap:Ethernet  HWaddr da:ba:91:38:43:0c  
          BROADCAST NOARP  MTU:1500  Metric:1
          RX packets:0 errors:0 dropped:0 overruns:0 frame:0
          TX packets:0 errors:0 dropped:0 overruns:0 carrier:0
          collisions:0 txqueuelen:0 
          RX bytes:0 (0.0 B)  TX bytes:0 (0.0 B)

eql       Link encap:Serial Line IP  
          MASTER  MTU:576  Metric:1
          RX packets:0 errors:0 dropped:0 overruns:0 frame:0
          TX packets:0 errors:0 dropped:0 overruns:0 carrier:0
          collisions:0 txqueuelen:5 
          RX bytes:0 (0.0 B)  TX bytes:0 (0.0 B)

eth0      Link encap:Ethernet  HWaddr 12:61:b9:e0:8c:6b  
          inet addr:172.31.39.169  Bcast:172.31.47.255  Mask:255.255.240.0
          inet6 addr: fe80::1061:b9ff:fee0:8c6b/64 Scope:Link
          UP BROADCAST RUNNING MULTICAST  MTU:1500  Metric:1
          RX packets:704 errors:0 dropped:0 overruns:0 frame:0
          TX packets:477 errors:0 dropped:0 overruns:0 carrier:0
          collisions:0 txqueuelen:1000 
          RX bytes:77419 (77.4 KB)  TX bytes:54672 (54.6 KB)

ifb0      Link encap:Ethernet  HWaddr 12:e4:cc:79:09:7b  
          BROADCAST NOARP  MTU:1500  Metric:1
          RX packets:0 errors:0 dropped:0 overruns:0 frame:0
          TX packets:0 errors:0 dropped:0 overruns:0 carrier:0
          collisions:0 txqueuelen:32 
          RX bytes:0 (0.0 B)  TX bytes:0 (0.0 B)

ifb1      Link encap:Ethernet  HWaddr a2:40:2b:de:98:06  
          BROADCAST NOARP  MTU:1500  Metric:1
          RX packets:0 errors:0 dropped:0 overruns:0 frame:0
          TX packets:0 errors:0 dropped:0 overruns:0 carrier:0
          collisions:0 txqueuelen:32 
          RX bytes:0 (0.0 B)  TX bytes:0 (0.0 B)

lo        Link encap:Local Loopback  
          inet addr:127.0.0.1  Mask:255.0.0.0
          inet6 addr: ::1/128 Scope:Host
          UP LOOPBACK RUNNING  MTU:16436  Metric:1
          RX packets:0 errors:0 dropped:0 overruns:0 frame:0
          TX packets:0 errors:0 dropped:0 overruns:0 carrier:0
          collisions:0 txqueuelen:0 
          RX bytes:0 (0.0 B)  TX bytes:0 (0.0 B)
</pre>

</dd>
<dt><code>netstat -na</code></dt><dd>



<pre class="example">Active Internet connections (servers and established)
Proto Recv-Q Send-Q Local Address           Foreign Address         State      
tcp        0      0 0.0.0.0:22              0.0.0.0:*               LISTEN     
tcp        0     32 172.31.39.169:22        72.76.187.129:60188     ESTABLISHED
tcp6       0      0 :::22                   :::*                    LISTEN     
udp        0      0 0.0.0.0:68              0.0.0.0:*                          
Active UNIX domain sockets (servers and established)
Proto RefCnt Flags       Type       State         I-Node   Path
unix  2      [ ACC ]     STREAM     LISTENING     6700     /tmp/ssh-KyDVxrS882/agent.882
unix  4      [ ]         DGRAM                    5651     /dev/log
unix  2      [ ACC ]     STREAM     LISTENING     3541     @/com/ubuntu/upstart
unix  2      [ ]         DGRAM                    3640     @/org/kernel/udev/udevd
unix  2      [ ACC ]     STREAM     LISTENING     5599     /var/run/dbus/system_bus_socket
unix  3      [ ]         STREAM     CONNECTED     6697     
unix  3      [ ]         STREAM     CONNECTED     6696     
unix  3      [ ]         STREAM     CONNECTED     6558     /var/run/dbus/system_bus_socket
unix  3      [ ]         STREAM     CONNECTED     6557     
unix  2      [ ]         DGRAM                    6556     
unix  3      [ ]         STREAM     CONNECTED     6009     /var/run/dbus/system_bus_socket
unix  3      [ ]         STREAM     CONNECTED     6008     
unix  3      [ ]         STREAM     CONNECTED     5983     /var/run/dbus/system_bus_socket
unix  3      [ ]         STREAM     CONNECTED     5982     
unix  2      [ ]         DGRAM                    5724     
unix  3      [ ]         STREAM     CONNECTED     5629     /var/run/dbus/system_bus_socket
unix  3      [ ]         STREAM     CONNECTED     5628     
unix  3      [ ]         STREAM     CONNECTED     5612     
unix  3      [ ]         STREAM     CONNECTED     5611     
unix  3      [ ]         DGRAM                    3669     
unix  3      [ ]         DGRAM                    3668     
unix  3      [ ]         STREAM     CONNECTED     3623     @/com/ubuntu/upstart
unix  3      [ ]         STREAM     CONNECTED     3622 
</pre>

</dd>
</dl>


</div>

</div>
